```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=rVB1x]
module.serverless-example-api.module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=781149127351]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_gateway.aws_api_gateway_account.account will be created
  + resource "aws_api_gateway_account" "account" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # module.api_gateway.aws_iam_role.api_gateway_cloudwatch will be created
  + resource "aws_iam_role" "api_gateway_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "api-gateway-cloudwatch"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.api_gateway.aws_iam_role_policy.api_gateway_cloudwatch will be created
  + resource "aws_iam_role_policy" "api_gateway_cloudwatch" {
      + id     = (known after apply)
      + name   = "default"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```